#+TITLE: Hardwired IC Ramp Comparison — SIR vs Baccam
#+AUTHOR: Ramakrishna Suresh
#+PROPERTY: header-args:julia-vterm :session *julia* :results output :exports both :dir (projectile-project-root) :tangle yes :comments both
#+STARTUP: inlineimages overview

** True ODE and noisy data

The SIR model has states ~O(1) and uses a ZScoreTransform.  This is the
"easy" case where the hardwired IC should work well regardless of ramp
choice, since there is no log transform to create scale mismatches.

True parameters: β = 1.5, γ = 1.0, y₀ = [3, 0.001, 0].

#+begin_src julia-vterm

function SIR_model!(du, u, p, t)
    S, I, R = u
    du[1] = -p.β * S * I
    du[2] =  p.β * S * I - p.γ * I
    du[3] =  p.γ * I
end

sir_true_params = (β = 1.5f0, γ = 1.0f0)
sir_u0     = Float32[3.0f0, 0.001f0, 0.0f0]
sir_t_span = (0.0f0, 10.0f0)
sir_t_fine = collect(range(sir_t_span[1], sir_t_span[2], length = 2001))

sir_sol = solve(
    ODEProblem(SIR_model!, sir_u0, sir_t_span, sir_true_params),
    Tsit5(); saveat = sir_t_fine
)
sir_sol_array = Array(sir_sol)

println("SIR ODE solved: $(size(sir_sol_array))")
#+end_src

#+RESULTS:
: SIR ODE solved: (3, 2001)

#+begin_src julia-vterm

rng_sir = MersenneTwister(42)
sir_noise_σ = 0.1f0
sir_n_tp    = 15
sir_n_mice  = 8

sir_idx   = round.(Int, range(1, length(sir_t_fine), length = sir_n_tp))
sir_t_obs = Float32.(sir_t_fine[sir_idx])
sir_Y_true = Float32.(sir_sol_array[:, sir_idx])

sir_ε = randn(rng_sir, Float32, 3, sir_n_tp, sir_n_mice)
sir_Y_noisy = clamp.(
    sir_Y_true .+ sir_noise_σ .* sir_ε,    # additive noise (states ~O(1))
    0f0, Inf32
)
sir_Y_mean = dropdims(mean(sir_Y_noisy; dims = 3); dims = 3)

println("SIR training data: $(sir_n_tp) timepoints × $(sir_n_mice) mice")
println("Y_mean shape: $(size(sir_Y_mean))")
println("Y range: $(extrema(sir_Y_mean))")
#+end_src

#+RESULTS:
: SIR training data: 15 timepoints × 8 mice
: Y_mean shape: (3, 15)
: Y range: (0.012565591f0, 3.0103898f0)

** True ODE and noisy data

The Baccam model has states spanning ~10 orders of magnitude and uses a
LogTransform.  This is where the hardwired IC + log interaction should
bite hardest.

True parameters: β = 2.7e-5, δ = 4.0, p = 1.2e-2, c = 3.0, y₀ = [4e8, 0, 9.3e-2].

#+begin_src julia-vterm

function Baccam_model!(du, u, p, t)
    T, I, V = u
    du[1] = -p.β * T * V
    du[2] =  p.β * T * V - p.δ * I
    du[3] =  p.p * I     - p.c * V
end

bac_true_params = (β = 2.7f-5, δ = 4.0f0, p = 1.2f-2, c = 3.0f0)
bac_u0     = Float32[4.0f8, 0.0f0, 9.3f-2]
bac_t_span = (0.0f0, 8.0f0)
bac_t_fine = collect(range(bac_t_span[1], bac_t_span[2], length = 2001))

bac_sol = solve(
    ODEProblem(Baccam_model!, bac_u0, bac_t_span, bac_true_params),
    Tsit5(); saveat = bac_t_fine
)
bac_sol_array = Array(bac_sol)

println("Baccam ODE solved: $(size(bac_sol_array))")
println("State ranges:  T=[$(extrema(bac_sol_array[1,:]))]")
println("               I=[$(extrema(bac_sol_array[2,:]))]")
println("               V=[$(extrema(bac_sol_array[3,:]))]")
#+end_src

#+RESULTS:
: Baccam ODE solved: (3, 2001)
: State ranges:  T=[(8176.1836f0, 4.0f8)]
:                I=[(0.0f0, 1.5729f8)]
:                V=[(0.073235795f0, 422674.88f0)]

#+begin_src julia-vterm

rng_bac = MersenneTwister(42)
bac_noise_σ = 0.5f0
bac_n_tp    = 10
bac_n_mice  = 12

bac_idx   = round.(Int, range(1, length(bac_t_fine), length = bac_n_tp))
bac_t_obs = Float32.(bac_t_fine[bac_idx])
bac_Y_true = Float32.(bac_sol_array[:, bac_idx])

bac_ε = randn(rng_bac, Float32, 3, bac_n_tp, bac_n_mice)
bac_Y_noisy = clamp.(
    bac_Y_true .* exp.(bac_noise_σ .* bac_ε .- 0.5f0 * bac_noise_σ^2),
    0f0, Inf32
)
bac_Y_mean = dropdims(mean(bac_Y_noisy; dims = 3); dims = 3)

println("Baccam training data: $(bac_n_tp) timepoints × $(bac_n_mice) mice")
println("Y_mean shape: $(size(bac_Y_mean))")
#+end_src

#+RESULTS:
: Baccam training data: 10 timepoints × 12 mice
: Y_mean shape: (3, 10)

